In [16]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1116,12259,65119,16699],index=['서울','부산','인천','대구'])
s

서울     1116
부산    12259
인천    65119
대구    16699
dtype: int64

In [5]:
print(s.index);s.values

Index(['서울', '부산', '인천', '대구'], dtype='object')

array([ 1116, 12259, 65119, 16699], dtype=int64)

In [6]:
s.name = '농작물 생산량(톤)'
s.index.name = '지역구'
print(s)

지역구
서울     1116
부산    12259
인천    65119
대구    16699
Name: 농작물 생산량(톤), dtype: int64

In [7]:
s1 = s/1000
s1.name = '농작물 생산량(k톤)'

In [8]:
s1

지역구
서울     1.116
부산    12.259
인천    65.119
대구    16.699
Name: 농작물 생산량(k톤), dtype: float64

In [9]:
s[0], s['서울']

(1116, 1116)

In [12]:
s[(s>10000) & (s<20000)]

지역구
부산    12259
대구    16699
Name: 농작물 생산량(톤), dtype: int64

In [13]:
for k,v in s.items():
    print(k,v)

서울 1116
부산 12259
인천 65119
대구 16699

In [15]:
s.keys()

Index(['서울', '부산', '인천', '대구'], dtype='object', name='지역구')

In [17]:
d1 = {'서울':1, '부산':2, '제주도':123123}
d2 = pd.Series(d1)
d2

서울          1
부산          2
제주도    123123
dtype: int64

In [18]:
import random

In [39]:
key100 = random.sample(list(range(120)),100)
key80 = random.sample(list(range(120)),80)
value100 = random.sample(list(range(120)),100)
value80 = random.sample(list(range(120)),80)
series100 = pd.Series(value100,index=key100)
series80 = pd.Series(value80,index=key80)

In [40]:
s_100_80_sub = series100 - series80

In [44]:
for k,v in s_100_80_sub[s_100_80_sub.isna()==False].items():
    print(k,v)

0 -33.0
1 -28.0
2 -49.0
4 2.0
5 83.0
8 53.0
10 -23.0
14 2.0
16 9.0
17 -35.0
18 48.0
19 62.0
21 -38.0
22 -52.0
25 -81.0
26 -29.0
27 46.0
28 -4.0
29 83.0
31 -53.0
32 -46.0
34 104.0
35 10.0
36 81.0
37 -75.0
38 7.0
40 10.0
41 39.0
46 -19.0
47 103.0
48 -46.0
51 -23.0
52 -87.0
53 9.0
54 -39.0
56 -21.0
57 -33.0
63 -57.0
64 51.0
65 52.0
66 87.0
70 11.0
71 -19.0
73 -66.0
75 -36.0
78 -8.0
81 -52.0
82 29.0
84 -92.0
85 40.0
86 -54.0
89 -19.0
90 -39.0
91 2.0
94 -33.0
95 35.0
97 68.0
98 -4.0
99 89.0
101 68.0
103 -31.0
104 -108.0
106 -11.0
107 -50.0
109 -8.0
110 -37.0
112 3.0
113 -13.0
114 66.0
115 -66.0
116 -59.0
117 -66.0

In [47]:
data = {
'2021' : [1116, 12259, 16699, 65119],
'2020' : [628, 11075, 15695, 56013],
'2019' : [678,12700,15148,55443],
'2018' : [712, 13597, 16052, 56024],
'농지면적순위' : [4,3,2,1]
}
columns = ['농지면적순위', '2021', '2020', '2019', '2018']
index = ['서울','부산','대구','인천']
df = pd.DataFrame(data, index=index, columns=columns)
df

    농지면적순위   2021   2020   2019   2018
서울       4   1116    628    678    712
부산       3  12259  11075  12700  13597
대구       2  16699  15695  15148  16052
인천       1  65119  56013  55443  56024

In [48]:
df['2018-2021 변화율'] = ((df['2021']-df['2018'])/ df['2018'])*100
df

    농지면적순위   2021   2020   2019   2018  2018-2021 변화율
서울       4   1116    628    678    712      56.741573
부산       3  12259  11075  12700  13597      -9.840406
대구       2  16699  15695  15148  16052       4.030650
인천       1  65119  56013  55443  56024      16.234114

In [49]:
df.T
# 한 컬럼의 dtype은 동일해야 하는데 Transpose되면서 변화율의 float 타입때문에 모든 원소가 float type으로 변함

                        서울            부산           대구            인천
농지면적순위            4.000000      3.000000      2.00000      1.000000
2021           1116.000000  12259.000000  16699.00000  65119.000000
2020            628.000000  11075.000000  15695.00000  56013.000000
2019            678.000000  12700.000000  15148.00000  55443.000000
2018            712.000000  13597.000000  16052.00000  56024.000000
2018-2021 변화율    56.741573     -9.840406      4.03065     16.234114

In [50]:
df.sort_values(by='농지면적순위',ascending=True)

    농지면적순위   2021   2020   2019   2018  2018-2021 변화율
인천       1  65119  56013  55443  56024      16.234114
대구       2  16699  15695  15148  16052       4.030650
부산       3  12259  11075  12700  13597      -9.840406
서울       4   1116    628    678    712      56.741573

In [51]:
df.iloc[0,0]

4

In [57]:
df.iloc[0][0]

4.0

In [68]:
a = ['국어','영어','수학','과학']
b = [80,90,70,30]
c = [90,50,100,50]
d = [70,60,50,80]
e = [50,100,70,80]
data = pd.DataFrame([b,c,d,e],columns=a,index=['철수','영희','길동','슬기'])
data

    국어   영어   수학  과학
철수  80   90   70  30
영희  90   50  100  50
길동  70   60   50  80
슬기  50  100   70  80

In [69]:
data1 = data
data1['학생별 평균'] = data.mean(axis=1)
data1.loc['과목별 평균'] = data.mean()

In [70]:
data1

          국어     영어     수학    과학  학생별 평균
철수      80.0   90.0   70.0  30.0    67.5
영희      90.0   50.0  100.0  50.0    72.5
길동      70.0   60.0   50.0  80.0    65.0
슬기      50.0  100.0   70.0  80.0    75.0
과목별 평균  72.5   75.0   72.5  60.0    70.0